app/controllers/admins_backoffice/admins_controller.rb

  def index
    @admins = Admin.all.page(params[:page])
---
SELECT  "admins".* FROM "admins" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "admins"

  def update
    if @admin.update(params_admin)
---
UPDATE "admins" SET "email" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["email", "romona_padberg@schaefer.biz"], ["updated_at", "2020-05-31 13:33:04.561073"], ["id", 2]]

  def create
    @admin = Admin.new(params_admin)
    if @admin.save
---
INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def destroy
    if @admin.destroy
---
DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 3]]

  def set_admin
    @admin = Admin.find(params[:id])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]