app/controllers/admins_backoffice/subjects_controller.rb

SELECT  "subjects".* FROM "subjects" ORDER BY "subjects"."description" ASC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "subjects"
---
  def index
    respond_to do |format|
      format.html { @subjects = Subject.all.order(:description).page(params[:page]) }

UPDATE "subjects" SET "description" = ?, "updated_at" = ? WHERE "subjects"."id" = ?  [["description", "Acionamentos e controles elétricoss"], ["updated_at", "2020-06-02 21:30:23.088321"], ["id", 1]]
---
  def update
    if @subject.update(params_subject)

INSERT INTO "subjects" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Algoritmos"], ["created_at", "2020-06-02 21:34:50.481702"], ["updated_at", "2020-06-02 21:34:50.481702"]]
---
  def create
    @subject = Subject.new(params_subject)
    if @subject.save

DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 2]]
---
  def destroy
    if @subject.destroy

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_subject
    @subject = Subject.find(params[:id])